/* Translation.strings\n    SAPTracker\n  \n    Created by Raimund Wege on 27.07.16.\n    Copyright © 2016 com.sap.sailing. All rights reserved.\n  \n\n   MARK: - Common */
"Common.Cancel" = "Cancel";

"Common.OK" = "OK";

"Common.Info" = "Info";

"Common.Warning" = "Warning";

"Common.Error" = "Error";

"Common.Yes" = "Yes";

"Common.No" = "No";

"Common.Settings" = "Settings";

"Common.Logout" = "Logout";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Hello %@";

"RegattaCheckInController.WelcomeAlert.Message" = "You are signing in as %@.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "That's not me!";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Mode";

"GPSFixController.Mode.Error" = "API-Error";

"GPSFixController.Mode.BatterySaving" = "Battery Saving";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "Online";

"GPSFixController.Mode.Offline" = "Offline";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "GPS is turned off for this app, but tracking requires GPS positions. Do you want to turn on GPS in the location settings?";

"LocationManager.LocationServicesDisabledError" = "GPS is turned off, but tracking requires GPS positions. Do you want to turn on GPS in the location settings?";

"LocationManager.Status" = "Status";

"LocationManager.Status.Tracking" = "Tracking";

"LocationManager.Status.NotTracking" = "No GPS Signal!";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "No competitor or mark id found in QR code.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Could not complete operation on server. Please try again.";

"CheckInRequestManagerError.GetBoatFailed" = "Couldn't get boat.";

"CheckInRequestManagerError.GetCompetitorFailed" = "Couldn't get competitor.";

"CheckInRequestManagerError.GetEventFailed" = "Couldn't get event.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Couldn't get leaderboard.";

"CheckInRequestManagerError.GetMarkFailed" = "Couldn't get mark.";

"CheckInRequestManagerError.GetTeamFailed" = "Couldn't get team.";

"CheckInRequestManagerError.PostCheckInFailed" = "Check-in failed.";

"CheckInRequestManagerError.PostCheckOutFailed" = "Check-out failed.";

"CheckInRequestManagerError.PostGPSFixFailed" = "Couldn't send GPS positions.";

"CheckInRequestManagerError.PostTeamImageFailed" = "Couldn't upload team image.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "The team image URL is invalid.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Regattas";

"StartView.TrainingButton.Title" = "Single Training";

/* MARK: - AboutView */
"AboutView.Title" = "About this app";

"AboutView.PartnershipTextView.Text" = "The SAP Sail InSight app supports live tracking of race boats by leveraging mobile phone technology, allowing the ability for friends and fans to follow racing whether onsite or online through live leaderboards and 2D visualization. Following racing sailors can replay their races allowing the opportunity to review performance and optimize strategies all available at: https://www.sapsailing.com\n\nSAP supports US Sailing through the implementation of a range of innovative technology solutions, delivering analytics to help teams and sailors improve performance whilst also providing applications to help sailing operations run more efficiently.\n\nAs the national governing body for sailing, US Sailing provides leadership, integrity and growth for the sport including training and education programs for instructors and race officials alongside administration and oversight of competitive sailing across the country.";

"AboutView.TermsButton.Title" = "EULA";

"AboutView.VersionTitleLabel.Text" = "Version";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Course over Ground";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Regattas";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Your Regattas:";

"RegattaCheckInListView.FooterTextView.Text" = "More information on\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "The QR code can be found on your confirmation of participation.";

"RegattaCheckInListView.TermsAlert.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.Message" = "By using this App you confirm to accept the SAP SE end user license agreement. Please read this EULA here.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "EULA";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Confirm";

"RegattaCheckInListView.NoCameraAlert.Message" = "Device has no camera.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Don't Have a QR Code?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Please contact race management if you have not received a QR code.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Trainings";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Your Trainings:";

"TrainingCheckInListView.FooterTextView.Text" = "To manage your training sessions please create at least one training by using the plus button.";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analyze";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Remove Training";

"TrainingView.FinishButton.Title" = "Finish";

"TrainingView.ReactivateAlert.Title" = "Reactivate Training";

"TrainingView.ReactivateAlert.Message" = "This training session has been finished. Do you really want to proceed and reactivate this session?";

"TrainingView.ReactivatedAlert.Title" = "Training session is now active.";

"TrainingView.FinishAlert.Title" = "Finish Training";

"TrainingView.FinishAlert.Message" = "Would you like to finish this training session?";

"TrainingView.FinishedAlert.Title" = "The training session was successfully finished.";

"TrainingView.CheckOutAlert.Message" = "Do you REALLY want to remove this training session from your device?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Create Training";

"CreateTrainingView.BoatClassNameLabel.Text" = "Boatclass";

"CreateTrainingView.CreateTrainingButton.Title" = "Create Training";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Leaderboard";

/* MARK: - LicenseView */
"LicenseView.Title" = "License Information";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Days";

"RegattaView.CountdownHoursTitleLabel.Text" = "Hours";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minutes";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "The regatta starts in:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "The regatta is in progress.";

"RegattaView.AnnouncementLabel.Text" = "Please listen to announcements.";

"RegattaView.EventButton.Title" = "Event";

"RegattaView.StartTrackingButton.Title" = "Start Tracking";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Checkout";

"RegattaView.CheckOutAlert.Message" = "Do you REALLY want to logout? You will need to re-login with the provided QR code to access your regatta!";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Photo";

"CompetitorView.SelectImageAlert.Message" = "Do you want to use an existing image or take a new one?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Take Photo";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Existing";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Error during upload.\nTap to retry.";

"CompetitorView.TeamImageAddButton.Title" = "Add Team Photo";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Error uploading image";

/* MARK: - ScanView */
"ScanView.Title" = "Scan QR Code";

"ScanView.IncorrectCodeAlert.Message" = "Invalid QR Code";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Speed over Ground";

/* MARK: - SettingsView */
"SettingsView.Title" = "Settings";

"SettingsView.TableView.BatterySavingSection.Title" = "Battery Saving";

"SettingsView.TableView.DeviceSection.Title" = "Device Information";

"SettingsView.TableView.TrainingSection.Title" = "Training Area";

"SettingsView.BatterySavingTitleLabel.Text" = "Save Energy";

"SettingsView.BatterySavingDescriptionLabel.Text" = "GPS updates are being sent to server every %0.0f seconds.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Device Identifier";

"SettingsView.TrainingServerTitleLabel.Text" = "Server Endpoint";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Tracking Time";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Unsent Fixes";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "GPS Accuracy";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "no GPS";

"TrackingView.StopTrackingButton.Title" = "Stop Tracking";

"TrackingView.StopTrackingAlert.Title" = "Please confirm";

"TrackingView.StopTrackingAlert.Message" = "Do you really want to stop tracking?";

